src/Catalogs/ОбнаружениеИнцидентовОперативное/ОбнаружениеИнцидентовОперативное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбнаружениеИнцидентовОперативное</name>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхИнтервал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхВремя</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеДанныхФункция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначенияПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеДобавление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантТипаПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФильтра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ГруппыСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользованиеОперативнойПамятиПроцессами</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кластер1С</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийСервер1С</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧислоАварийноЗавершенныхПроцессов</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочийСервер</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧислоСеансов</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кластер</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПриложения</name>
      <type>
        <types>EnumRef.ВидыПриложений</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматнаяСтрокаЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешИнцидента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОбнаружения</name>
    <attributes>
      <name>УникальныйИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСрабатывания</name>
      <type>
        <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбнаружения</name>
      <type>
        <types>EnumRef.ТипыОбнаруженияИнцидентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньИнцидента</name>
      <type>
        <types>EnumRef.УровниИнцидентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОбнаруженияПоУмолчанию</name>
    <attributes>
      <name>УсловиеСрабатывания</name>
      <type>
        <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбнаружения</name>
      <type>
        <types>EnumRef.ТипыОбнаруженияИнцидентов</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньИнцидента</name>
      <type>
        <types>EnumRef.УровниИнцидентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееСрабатывание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатываний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБаза</name>
    <comment>Инфобаза или название счетчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРеакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеОповещатьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроигнорироватьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОткрытияПовторная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатыванийПовторное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникИнцидента</name>
    <type>
      <types>CatalogRef.ОбнаружениеИнцидентовОперативное</types>
      <types>String</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
      <types>CatalogRef.ГруппыСчетчиков</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеНавигационнойСсылкиИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыПоказателей/ТипыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателей</name>
  <enumValues>
    <name>Счетчики</name>
  </enumValues>
  <enumValues>
    <name>ИспользованиеОперативнойПамятиПроцессами</name>
  </enumValues>
  <enumValues>
    <name>ЧислоАварийноЗавершенныхПроцессов</name>
  </enumValues>
  <enumValues>
    <name>ЧислоСеансов</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыИнцидентов/СтатусыИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнцидентов</name>
  <enumValues>
    <name>НовыйИнцидент</name>
  </enumValues>
  <enumValues>
    <name>Проигнорировано</name>
  </enumValues>
  <enumValues>
    <name>ВзятоВРаботу</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
  <enumValues>
    <name>Неактуальный</name>
  </enumValues>
</mdclass:Enum>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТипыИнцидентов/ТипыИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыИнцидентов</name>
  <attributes>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАдм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЦКК</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбнаружениеИнцидентов</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ОбнаружениеИнцидентовОперативное/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеПроцедуры    
    
Процедура ПередЗаписью(Отказ)
    
    Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
        ЭтотОбъект.УстановитьСсылкуНового(Справочники.ОбнаружениеИнцидентовОперативное.ПолучитьСсылку());
    КонецЕсли;
        
    Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ТипИнцидента) Тогда
        ЭтотОбъект.ТипИнцидента = ПолучитьТипИнцидента();
    Иначе
        Если ЭтотОбъект.ТипИнцидента.Наименование <> ЭтотОбъект.Наименование Тогда
            ТипИнцидентаОбъект = ЭтотОбъект.ТипИнцидента.ПолучитьОбъект();
            ТипИнцидентаОбъект.Наименование = ЭтотОбъект.Наименование;
            ТипИнцидентаОбъект.Записать();
        КонецЕсли;
    КонецЕсли;
    
    Если ЭтотОбъект.ТипПоказателя = Перечисления.ТипыПоказателей.Счетчики Тогда
        ПередЗаписьюСчетчики();
    ИначеЕсли ЭтотОбъект.ТипПоказателя = Перечисления.ТипыПоказателей.ИспользованиеОперативнойПамятиПроцессами Тогда
        ПередЗаписьюИспользованиеОперативнойПамятиПроцессами();
    ИначеЕсли ЭтотОбъект.ТипПоказателя = Перечисления.ТипыПоказателей.ЧислоАварийноЗавершенныхПроцессов Тогда
        ПередЗаписьюЧислоАварийноЗавершенныхПроцессов();
    ИначеЕсли ЭтотОбъект.ТипПоказателя = Перечисления.ТипыПоказателей.ЧислоСеансов Тогда
        ПередЗаписьюЧислоСеансов();
    КонецЕсли;
        
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    Если ТипПоказателя = Перечисления.ТипыПоказателей.Счетчики Тогда
        ПриЗаписиСчетчики();
    ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателей.ИспользованиеОперативнойПамятиПроцессами Тогда
        ПриЗаписиИспользованиеОперативнойПамятиПроцессами();
    ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателей.ЧислоАварийноЗавершенныхПроцессов Тогда
        ПриЗаписиЧислоАварийноЗавершенныхПроцессов();
    ИначеЕсли ТипПоказателя = Перечисления.ТипыПоказателей.ЧислоСеансов Тогда
        ПриЗаписиЧислоСеансов();
    КонецЕсли;
        
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
    
    ТипИнцидента = Неопределено;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПередЗаписью

Процедура ПередЗаписьюСчетчики()
    
    Для Каждого ТекСтрока Из Счетчики Цикл
        
        Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
            СсылкаСтрока = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
        Иначе
            СсылкаСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
        КонецЕсли;
        
        Данные = СсылкаСтрока + Строка(ТекСтрока.Счетчик.УникальныйИдентификатор());
        ТекСтрока.ХешИнцидента = Справочники.Инциденты.ХешИнцидента(Данные);
        
    КонецЦикла;
    
    УдалитьОбщая(ИспользованиеОперативнойПамятиПроцессами);
    УдалитьОбщая(ЧислоАварийноЗавершенныхПроцессов);
    УдалитьОбщая(ЧислоСеансов);    
    
КонецПроцедуры

Процедура ПередЗаписьюИспользованиеОперативнойПамятиПроцессами()
    
    Для Каждого ТекСтрока Из ИспользованиеОперативнойПамятиПроцессами Цикл
        
        Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
            СсылкаСтрока = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
        Иначе
            СсылкаСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
        КонецЕсли;
        
        Если ЭтотОбъект.ВариантТипаПоказателя = 0 Тогда
            Данные = СсылкаСтрока + Строка(ТекСтрока.Кластер1С.УникальныйИдентификатор());
        ИначеЕсли ЭтотОбъект.ВариантТипаПоказателя = 1 ИЛИ ЭтотОбъект.ВариантТипаПоказателя = 2 Тогда
            Данные = СсылкаСтрока + Строка(ТекСтрока.Кластер1С.УникальныйИдентификатор()) + Строка(ТекСтрока.РабочийСервер1С.УникальныйИдентификатор());
        КонецЕсли;
        ТекСтрока.ХешИнцидента = Справочники.Инциденты.ХешИнцидента(Данные);
        
    КонецЦикла;
    
    УдалитьОбщая(Счетчики);
    УдалитьОбщая(ЧислоАварийноЗавершенныхПроцессов);
    УдалитьОбщая(ЧислоСеансов);
    
КонецПроцедуры

Процедура ПередЗаписьюЧислоАварийноЗавершенныхПроцессов()
    
    Для Каждого ТекСтрока Из ЧислоАварийноЗавершенныхПроцессов Цикл
        
        Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
            СсылкаСтрока = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
        Иначе
            СсылкаСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
        КонецЕсли;
        
        Данные = СсылкаСтрока + Строка(ТекСтрока.РабочийСервер.УникальныйИдентификатор());
        ТекСтрока.ХешИнцидента = Справочники.Инциденты.ХешИнцидента(Данные);
        
    КонецЦикла;
    
    УдалитьОбщая(Счетчики);
    УдалитьОбщая(ИспользованиеОперативнойПамятиПроцессами);
    УдалитьОбщая(ЧислоСеансов);
    
КонецПроцедуры

Процедура ПередЗаписьюЧислоСеансов()
    
    Для Каждого ТекСтрока Из ЧислоСеансов Цикл
        
        Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
            СсылкаСтрока = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
        Иначе
            СсылкаСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
        КонецЕсли;
        
        Если ВариантТипаПоказателя = 0 Тогда
            Данные = СсылкаСтрока + Строка(ТекСтрока.Кластер.УникальныйИдентификатор());
        ИначеЕсли ВариантТипаПоказателя = 1 Тогда
            Данные = СсылкаСтрока + Строка(ТекСтрока.Кластер.УникальныйИдентификатор()) + Строка(ТекСтрока.ИнформационнаяБаза.УникальныйИдентификатор());
        ИначеЕсли ВариантТипаПоказателя = 2 Тогда
            Данные = СсылкаСтрока + Строка(ТекСтрока.Кластер.УникальныйИдентификатор()) + Строка(ТекСтрока.ИнформационнаяБаза.УникальныйИдентификатор()) + Строка(ТекСтрока.ВидПриложения);
        КонецЕсли;
        
        ТекСтрока.ХешИнцидента = Справочники.Инциденты.ХешИнцидента(Данные);
        
    КонецЦикла;
    
    УдалитьОбщая(Счетчики);
    УдалитьОбщая(ИспользованиеОперативнойПамятиПроцессами);
    УдалитьОбщая(ЧислоАварийноЗавершенныхПроцессов);
    
КонецПроцедуры

#КонецОбласти

#Область ПриЗаписи

Процедура ПриЗаписиСчетчики()
    
    ХешиИнцидентов = Новый ТаблицаЗначений;
    ХешиИнцидентов.Колонки.Добавить("ХешИнцидента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(64)));
    ХешиИнцидентов.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
    
    Для Каждого ТекСтрока Из Счетчики Цикл
        НовСтрока = ХешиИнцидентов.Добавить();
        НовСтрока.ХешИнцидента = ТекСтрока.ХешИнцидента;
        НовСтрока.Описание = ТекСтрока.Описание;
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    СоздатьКодыИнцидентов(Запрос, ХешиИнцидентов);
    СоздатьАвтоИнциденты(Запрос);
        
КонецПроцедуры

Процедура ПриЗаписиИспользованиеОперативнойПамятиПроцессами()
    
    ХешиИнцидентов = Новый ТаблицаЗначений;
    ХешиИнцидентов.Колонки.Добавить("ХешИнцидента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(64)));
    ХешиИнцидентов.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
    
    Для Каждого ТекСтрока Из ИспользованиеОперативнойПамятиПроцессами Цикл
        НовСтрока = ХешиИнцидентов.Добавить();
        НовСтрока.ХешИнцидента = ТекСтрока.ХешИнцидента;
        НовСтрока.Описание = ТекСтрока.Описание;
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    СоздатьКодыИнцидентов(Запрос, ХешиИнцидентов);
    СоздатьАвтоИнциденты(Запрос);
    
КонецПроцедуры

Процедура ПриЗаписиЧислоАварийноЗавершенныхПроцессов()
    
    ХешиИнцидентов = Новый ТаблицаЗначений;
    ХешиИнцидентов.Колонки.Добавить("ХешИнцидента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(64)));
    ХешиИнцидентов.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
    
    Для Каждого ТекСтрока Из ЧислоАварийноЗавершенныхПроцессов Цикл
        НовСтрока = ХешиИнцидентов.Добавить();
        НовСтрока.ХешИнцидента = ТекСтрока.ХешИнцидента;
        НовСтрока.Описание = ТекСтрока.Описание;
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    СоздатьКодыИнцидентов(Запрос, ХешиИнцидентов);
    СоздатьАвтоИнциденты(Запрос);
    
КонецПроцедуры

Процедура ПриЗаписиЧислоСеансов()
    
    ХешиИнцидентов = Новый ТаблицаЗначений;
    ХешиИнцидентов.Колонки.Добавить("ХешИнцидента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(64)));
    ХешиИнцидентов.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
    
    Для Каждого ТекСтрока Из ЧислоСеансов Цикл
        НовСтрока = ХешиИнцидентов.Добавить();
        НовСтрока.ХешИнцидента = ТекСтрока.ХешИнцидента;
        НовСтрока.Описание = ТекСтрока.Описание;
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    СоздатьКодыИнцидентов(Запрос, ХешиИнцидентов);
    СоздатьАвтоИнциденты(Запрос);
    
КонецПроцедуры

#КонецОбласти

Процедура СоздатьКодыИнцидентов(Запрос, ХешиИнцидентов)
        
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   ХешИнцидента,
    |   Описание
    |ПОМЕСТИТЬ
    |   ХешиИнцидентов
    |ИЗ
    |   &ХешиИнцидентов КАК ХешиИнцидентов
    |ИНДЕКСИРОВАТЬ ПО
    |   ХешИнцидента
    |;
    |ВЫБРАТЬ
    |   Инциденты.Ссылка,
    |   ХешиИнцидентов.ХешИнцидента,
    |   ХешиИнцидентов.Описание
    |ИЗ
    |   ХешиИнцидентов КАК ХешиИнцидентов
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   Справочник.Инциденты КАК Инциденты
    |ПО
    |   Инциденты.ХешИнцидента = ХешиИнцидентов.ХешИнцидента
    |ГДЕ
    |   Инциденты.Ссылка IS NULL
    |   ИЛИ ХешиИнцидентов.Описание <> Инциденты.Наименование 
    |;";
    
    Запрос.УстановитьПараметр("ХешиИнцидентов", ХешиИнцидентов);
    
    Результат = Запрос.Выполнить();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        Если НЕ ЗначениеЗаполнено(Выборка.Ссылка) Тогда
            Справочники.Инциденты.СоздатьЭлементПоХешу(Выборка.ХешИнцидента, Выборка.Описание);
        Иначе
            СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
            СпрОбъект.Наименование = Выборка.Описание;
            СпрОбъект.Записать();
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Процедура СоздатьАвтоИнциденты(Запрос)
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   Инциденты.Ссылка КАК Инцидент,
    |   &ТипИнцидента КАК ТипИнцидента
    |ИЗ
    |   ХешиИнцидентов КАК ХешиИнцидентов
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Инциденты КАК Инциденты
    |ПО
    |   Инциденты.ХешИнцидента = ХешиИнцидентов.ХешИнцидента
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   РегистрСведений.Инциденты КАК СостоянияИнцидентов
    |ПО
    |   СостоянияИнцидентов.Инцидент = Инциденты.Ссылка
    |   И СостоянияИнцидентов.ТипИнцидента = &ТипИнцидента
    |ГДЕ
    |   СостоянияИнцидентов.Инцидент IS NULL
    |";
    
    Запрос.УстановитьПараметр("ТипИнцидента", ЭтотОбъект.ТипИнцидента);
    
    Результат = Запрос.Выполнить();
    
    ТекДата = ТекущаяДата();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        МенеджерЗаписи = РегистрыСведений.Инциденты.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Инцидент = Выборка.Инцидент;
        МенеджерЗаписи.ТипИнцидента = Выборка.ТипИнцидента;
        МенеджерЗаписи.ПоследнееСрабатывание = ТекДата;
        МенеджерЗаписи.Статус = Перечисления.СтатусыИнцидентов.Закрыто;
        МенеджерЗаписи.ПодробноеСообщение = "Создан автоматически при записи оперативного обнаружения.";
        МенеджерЗаписи.УровеньИнцидента = Перечисления.УровниИнцидентов.Информация;
        МенеджерЗаписи.ИсточникИнцидента = ЭтотОбъект.Ссылка;
        МенеджерЗаписи.Записать(Истина);
        
    КонецЦикла;
    
КонецПроцедуры

Функция ПолучитьТипИнцидента()
    
    Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
        СсылкаСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового());
    Иначе
        СсылкаСтрока = Строка(ЭтотОбъект.Ссылка);
    КонецЕсли;
    
    Данные = СсылкаСтрока;
    ХешТипа = Справочники.Инциденты.ХешИнцидента(Данные);
    
    Возврат Справочники.ТипыИнцидентов.СоздатьЭлементПоХешу(ХешТипа, ЭтотОбъект.Наименование, Перечисления.УровниИнцидентов.Ошибка);
        
КонецФункции

Процедура УдалитьОбщая(Данные)
    
    Для Каждого ТекДанные Из Данные Цикл
        
        ПараметрыОтбора = Новый Структура("УникальныйИдентификаторСтроки", ТекДанные.УникальныйИдентификаторСтроки);
        Строки = ПараметрыОбнаружения.НайтиСтроки(ПараметрыОтбора);
        Для Каждого ТекСтрока Из Строки Цикл
            ПараметрыОбнаружения.Удалить(ТекСтрока);
        КонецЦикла;
        
    КонецЦикла;
    
    Данные.Очистить();
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
